const advices = [
    'Якщо Ви збираєтесь опустити руки, то можливо не варто  цього робити? Як співала Тіна Кароль у своїй пісні: «здатися ти завжди встигнеш». Тому можна спробувати ще раз.',
    'Сьогодні натхнення буде переслідувати Вас увесь день, тому не варто його просто так марнувати. Займіться творчістю, таким чином надасте відпочинок душі.',
    'Пам’ятайте, що поряд є люди які дійсно Вас люблять та цінують. Зробіть якийсь невеличкий сюрприз чи приємність комусь сьогодні. Покажіть людям, що й вони важливі.',
    'Скільки дивлюся я на Вас все дивуюся: коли Ви вже дочитаєте оту книгу? А може варто прочитати щось новеньке? Якщо уже щось читаєте, то Ви молодець! Ми пишаємося Вами – тримайте смайлика ☺',
    'Пані фортуна буде весь день Вас супроводжувати, тому не хвилюйтеся занадто, якщо сьогодні важливий іспит, нарада з керівництвом або будь-що інше. Усе складатиметься якнайкраще.',
    'Можливо сьогодні варто спробувати щось нове? Новий напій, змінити зачіску або ж піти новим шляхом? Просто спробуйте – з цього може вийти дійсно щось файне.',
    'Гарний день для будь-яких зустрічей. Ви здатні справити найкраще враження, тому так тримати!',
    'Не хвилюйтесь якщо щось не йде за Вашим планом. Можливо це просто нові можливості намагаються так до Вас дійти? Придивіться пильніше.',
    'Оу, сьогодні максимально продуктивний день. Зірки радять швидше доїдати вашу канапку та приступати до роботи.',
    'Сьогодні саме той день, коли варто почати займатися спортом. Фітнес або просто йога це вже обирати Вам.',
    'Ми бачимо трошки втомлене кошенятко, тому радимо зробити найближчим часом вихідний. Так, навіть якщо Ви щойно вийшли з відпустки.',
    'Зірки заряджають Вас неймовірною енергією! Тому сьогодні (а може й не лише сьогодні) Ви здатні доробити врешті решт ті кляті дедлайни.',
    'Немає з ким піти на прогулянку? Не біда, підіть на побачення із собою. Психологи максимально радять таке практикувати. Пригостіть себе улюбленим напоєм, прогуляйтеся із собою парком або можливо Ви вигадаєте щось ще цікавіше?',
    'Сьогодні день «анти жабки, що Вас душить». Купіть собі якусь дрібничку, що підійме настрій Вашій внутрішній дитині.',
    'Може сьогодні ввечері подивимося якийсь серіал, який довго відкладали? З Вас смаколики.',
    'Не варто сьогодні поспішати. Хто поспішає, той у людей сміх викликає.',
    'Сьогодні день догляду за собою: сходіть на релаксуючий масаж або ж зробіть вітамінну масочку для обличчя.',
    'Почніть день з посмішки, бо навіть якщо за вікном дощ, то не варто сумувати та впадати у депресію.',
    'Спокій та зосередженість – Ваша головна зброя. Не варто акцентувати увагу на нечемних та негативних людях.',
    'Пам’ятайте, що мрії обов’язково здійснюються! Йдіть до них хоч яким би складним не був шлях.',
    'А чи давно Ви були на плановому огляді у лікаря? Можливо варто потурбуватися про своє здоров’я хоча й так не хочеться нікуди йти?',
    'Сьогодні офіційно дозволяємо трошки повередувати – інколи це корисно.',
    'Офіційний день душніли – можете сміливо шукати ідеальні образи та проявляти свій прихований перфекціонізм.',
    'Настрій дня: сидіти з келихом вина та філософствувати про буття. У Вас так? То сміливо приєднуйтесь до нас – будемо разом сидіти та теревеніти.',
    'Слухайте, ну скільки можна? Купіть уже собі ту книжку/сервіз/шафу/сукню/гру. Внутрішня дитиня скоро влаштує бунт.'
];

const div = document.querySelector('.advice');

div.addEventListener('click', () => {
    div.classList.add('animation')
    div.classList.add('done');
    let opacity = 0
    for (let time = 100; time <= 1500; time += 100) {
        setTimeout(() => {
            div.style.opacity = opacity.toString();
            opacity += 0.066;
            const index = Math.floor(Math.random() * advices.length);
            div.textContent = advices[index];
        }, time);
    };
}, {
    once: true
});